---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsRebarContainerParameter(Autodesk.Revit.DB.ElementId)
source: html/f1af9db7-e66c-f8db-8526-1e52833cb830.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerParameterManager.IsRebarContainerParameter Method

Checks if the parameter is a Rebar Container parameter

## Syntax (C#)
```csharp
public bool IsRebarContainerParameter(
	ElementId paramId
)
```

## Parameters
- **paramId** (`Autodesk.Revit.DB.ElementId`) - The id of the parameter element

## Returns
True if the parameter is a Rebar Container parameter

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null